import keyboard as наборница

включена_ли_кнопка = {}
for и in range(1, 58):
    включена_ли_кнопка[и] = False

доп_раскладка = False
кнопка_англ_раскладки = 57

горячки = [
    ['while', 17, 35],
    ['if', 23, 33],
    ['in', 23, 49],
    ['break', 48, 19],
    ['continue', 46, 24],
    ['is', 23, 31],
    ['as', 30, 31],
    ['and', 30, 49],
    ['return', 19, 18],
    ['class', 46, 38],
    ['True', 20, 19],
    ['False', 33, 30],
    ['print(', 25, 19],
    ['exit()', 18, 45],
    ['with', 17, 23],
    ['pass', 25, 30],
    ['import', 23, 50],
    ['else', 18, 38],
    ['elif', 18, 33],
    ['from', 33, 19],
    ['enumerate(', 18, 49],
    ['list(', 38, 23],
    ['range(', 19, 30],
    ['str(', 31, 20],
    ['zip(', 44, 23],
    ['len(', 38, 18],
    ['q', 43, 16],
    ['w', 43, 17],
    ['e', 43, 18],
    ['r', 43, 19],
    ['t', 43, 20],
    ['y', 43, 21],
    ['u', 43, 22],
    ['i', 43, 23],
    ['o', 43, 24],
    ['p', 43, 25],
    ['a', 43, 30],
    ['s', 43, 31],
    ['d', 43, 32],
    ['f', 43, 33],
    ['g', 43, 34],
    ['h', 43, 35],
    ['j', 43, 36],
    ['k', 43, 37],
    ['l', 43, 38],
    ['z', 43, 44],
    ['x', 43, 45],
    ['c', 43, 46],
    ['v', 43, 47],
    ['b', 43, 48],
    ['n', 43, 49],
    ['m', 43, 50],
    ['#', 3, 4],
    [':', 38, 39],
    ['[', 25, 26],
    [']', 26, 27],
    ['{', 39, 26],
    ['}', 40, 27],
    ['<', 50, 51],
    ['>', 51, 52]
]

соответы_букв_кодам = {
    16: 'q',
    17: 'w',
    18: 'e',
    19: 'r',
    20: 't',
    21: 'y',
    22: 'u',
    23: 'i',
    24: 'o',
    25: 'p',
    30: 'a',
    31: 's',
    32: 'd',
    33: 'f',
    34: 'g',
    35: 'h',
    36: 'j',
    37: 'k',
    38: 'l',
    44: 'z',
    45: 'x',
    46: 'c',
    47: 'v',
    48: 'b',
    49: 'n',
    50: 'm'
}

def написать_текст_горячки(текст_горячки):
    наборница.send(14)
    наборница.send(14)
    наборница.write(текст_горячки)

def перевести_кир_на_англу():
    набираемая_ан_стркоа = ''
    for i in череда_зажатий_доп_раскладки:
        if i == кнопка_англ_раскладки:
            continue
        наборница.send(14)  # удаляем кир знаки
        набираемая_ан_стркоа += соответы_букв_кодам[i]  # пишем ан знаки
    наборница.send(14)  # удаляем пробел
    наборница.write(набираемая_ан_стркоа)

череда_зажатий_доп_раскладки = []
коды_двойных_нажатий = []

def нажимаемые_кнопки(e):
    global доп_раскладка
    global череда_зажатий_доп_раскладки
    global коды_двойных_нажатий

    код_кнопки = e.scan_code
    вид_события = e.event_type

    if вид_события == 'down' and код_кнопки == кнопка_англ_раскладки:
        череда_зажатий_доп_раскладки.append(код_кнопки)
        доп_раскладка = True

    if вид_события == 'up' and код_кнопки == кнопка_англ_раскладки:
        if len(череда_зажатий_доп_раскладки) > 1:
            перевести_кир_на_англу()
        череда_зажатий_доп_раскладки = []
        доп_раскладка = False

    if доп_раскладка and вид_события == 'down' and код_кнопки in соответы_букв_кодам:
        череда_зажатий_доп_раскладки.append(код_кнопки)



    if вид_события == 'down': # если нажата какая-нибудь кнопка, добавляем её в двойки
        коды_двойных_нажатий.append(код_кнопки)

        if len(коды_двойных_нажатий) == 2: # если в двойках две кнопки, то узнаём не горячки ли это
            начальная_кнопка = коды_двойных_нажатий[0]
            конечная_кнопка = коды_двойных_нажатий[1]
            for горячка in горячки: # перебираем все горячки
                if начальная_кнопка == горячка[1] and конечная_кнопка == горячка[2]: # если есть совпадение то выполняем горячку
                    написать_текст_горячки(горячка[0])

    if вид_события == 'up' and код_кнопки in коды_двойных_нажатий:
        коды_двойных_нажатий = []

наборница.hook(нажимаемые_кнопки)
наборница.wait()
